      ******************************************************************
      * Author:Tudor44
      * Date:24/04/2020
      * Purpose: MY FIRST COBOL PROGRAM
      * Tectonics: cobc
      ******************************************************************
        IDENTIFICATION DIVISION.
        PROGRAM-ID. HELLO-WORLD.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        PROCEDURE DIVISION.
        HELLO-WORLD.
            DISPLAY "Hello world, I'm Gaetano".
            STOP RUN.
